STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_TMAP_Unicast_Client/Core/Src/app_entry.c
    /* remove end of conversion interrupt */
    LL_ADC_REG_StopConversion(hjoy_adc[JOY1].Instance);
    while(LL_ADC_REG_IsConversionOngoing(hjoy_adc[JOY1].Instance) != 0);
    __HAL_ADC_DISABLE_IT(&hjoy_adc[JOY1], ADC_IT_EOC);
    LL_ADC_REG_StartConversion(hjoy_adc[JOY1].Instance);
  }
}

static void Joystick_ActionHandle(void)
{
  if (Joystick_Event == JOY_SEL)
  {
  }
  else if (Joystick_Event == JOY_UP)
  {
    Menu_Up();
  }
  else if (Joystick_Event == JOY_RIGHT)
  {
    Menu_Right();
  }
  else if (Joystick_Event == JOY_DOWN)
  {
    Menu_Down();
  }
  else if (Joystick_Event == JOY_LEFT)
  {
    Menu_Left();
  }
}
#endif  /* CFG_JOYSTICK_SUPPORTED */

#if (CFG_LCD_SUPPORTED == 1)

static void LCD_Init( void )
{
  /* BSP init LCD*/
  BSP_LCD_Init(0, LCD_ORIENTATION_LANDSCAPE);

  /* Set LCD Foreground Layer  */
  UTIL_LCD_SetFuncDriver(&LCD_Driver); /* SetFunc before setting device */
  UTIL_LCD_SetDevice(0);               /* SetDevice after funcDriver is set */

  BSP_LCD_DisplayOn(0);

  BSP_LCD_Clear(0,SSD1315_COLOR_BLACK);
  BSP_LCD_Refresh(0);

  /* Set the LCD Text Color */
  UTIL_LCD_SetFont(&Font12);
  UTIL_LCD_SetTextColor(SSD1315_COLOR_WHITE);
  UTIL_LCD_SetBackColor(SSD1315_COLOR_BLACK);
  BSP_LCD_Refresh(0);

  /* release bus for power optimisation */
  BSP_SPI3_DeInit();
}

#endif  /* CFG_LCD_SUPPORTED */


/**
  * @brief Configure PLL for the audio frequency, PLL output is used for the SAI peripheral and as the core clock
  * @retval None
  */
void AudioClock_Init(uint32_t audio_frequency_type)
{
  uint32_t target_freq;
  Codec_Frequency = audio_frequency_type;
  if (audio_frequency_type == SAMPLE_FREQ_44100_HZ)
  {
    target_freq = 90316800;
  }
  else
  {
    /* valid for 8k, 16k, 24k, 32k or 48k */
    target_freq = 98304000;
  }

  if ( target_freq !=  PLL_Target_Clock_Freq )
  {
    scm_pll_config_t pll_config;
    LOG_INFO_APP("Audio Clock Initialization\n");

    pll_config.pll_mode = PLL_FRACTIONAL_MODE;
    pll_config.PLLM = 6;
    pll_config.PLLP = 4;
    pll_config.PLLQ = 4;
    pll_config.PLLR = 4;

    /* VCO frequency should be in range 128 to 544 MHz */
    /* PLL fractionnal should allows to cover +/-550ppm around the targeted frequency*/
    if (target_freq == 90316800)
    {
      pll_config.PLLN = 67;  /* VCO = HSE/M * N * (1 + Nfrac / 8192) < 32 / 6 * (67 + 1) = 362.7 MHz */
      pll_config.PLLFractional = 6042;
      pll_config.AHB5_PLL1_CLKDivider = LL_RCC_AHB5_DIV_3;
      /* PLLSYS = 90.31673 MHz */
    }
    else
    {
      pll_config.PLLN = 73;  /* VCO = HSE/M * N * (1 + Nfrac / 8192) < 32 / 6 * (73 + 1) = 394.7 MHz */
      pll_config.PLLFractional = 5964;
      pll_config.AHB5_PLL1_CLKDivider = LL_RCC_AHB5_DIV_4;
      /* PLLSYS = 98.30396 MHz */
    }

    UTIL_LPM_SetStopMode(1 << CFG_LPM_AUDIO, UTIL_LPM_DISABLE);

    scm_pll_setconfig(&pll_config);

    scm_setsystemclock(SCM_USER_APP, SYS_PLL);

    /* enable P output used for the audio timer */
    LL_RCC_PLL1_EnableDomain_PLL1P();

    PLL_Target_Clock_Freq = target_freq;
  }
}

void PLL_Ready_ProcessIT(void)
{
  UTIL_SEQ_SetTask(1U << CFG_TASK_PLL_READY_ID, CFG_SEQ_PRIO_0);
}

void PLL_Ready_Task(void)
{
  /* set Link Layer audio timings */
  Evnt_timing_t event_time;
  event_time.drift_time    = ISO_PLL_DRIFT_TIME;
  event_time.exec_time     = ISO_PLL_EXEC_TIME;
  event_time.schdling_time = ISO_PLL_SCHDL_TIME;
  ll_intf_config_schdling_time(&event_time);

  CODEC_CLK_Init();

  AUDIO_PLLConfig_t corrector_pll_config;
  corrector_pll_config.PLLTargetFreq = PLL_Target_Clock_Freq;
  corrector_pll_config.VCOInputFreq = (32000000.0f / 6.0f); /* HSE / PLL_M */
  corrector_pll_config.PLLOutputDiv = 4; /* PLL_P */
  AUDIO_InitializeClockCorrector(&corrector_pll_config, 500, 4000);

  /* I2C init takes a long time, it is better to do it before CIS establishement */
  BSP_I2C3_Init();
}


static void AudioClock_Deinit( void )
{
  /* back to default timings */
  Evnt_timing_t event_time;
  event_time.drift_time    = DEFAULT_DRIFT_TIME;
  event_time.exec_time     = DEFAULT_EXEC_TIME;
  event_time.schdling_time = DEFAULT_SCHDL_TIME;
  ll_intf_config_schdling_time(&event_time);

  LOG_INFO_APP("Audio Clock Deinitialization\n");
  AUDIO_DeinitializeClockCorrector();

  scm_setsystemclock(SCM_USER_APP, NO_CLOCK_CONFIG);

  PLL_Target_Clock_Freq = 0;

  UTIL_LPM_SetStopMode(1 << CFG_LPM_AUDIO, UTIL_LPM_ENABLE);
}

HAL_StatusTypeDef MX_SAI1_ClockConfig(SAI_HandleTypeDef *hsai, uint32_t SampleRate)
{
  /* PLL already configured */

  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_SAI1;
  PeriphClkInit.Sai1ClockSelection = RCC_SAI1CLKSOURCE_PLL1P;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }

  __HAL_RCC_SAI1_CLK_ENABLE();

  return HAL_OK;
}

/**
  * @brief Adjust microphone gain using 3 pre-set configuration
  * @note  To be used at the initialization only, after BSP_AUDIO_xx_Init()
  * @param mode : value from 0 to 2, 0 for lowest gain and 2 for the highest
  */
static void BSP_MIC_Gain_Init(const uint8_t mode){
    
  const uint8_t Tab_mic_ctrl[3] =   {0x80, 0x00, 0x03};
  const uint8_t Tab_attenuator[3] = {0xF1, 0xF6, 0x00};    
  
  if( mode > 2)
  {
    Error_Handler();
  }

  uint8_t attenuator_gain = Tab_attenuator[mode];
  uint8_t mic_control = Tab_mic_ctrl[mode];
    
  BSP_I2C3_WriteReg(AUDIO_I2C_ADDRESS, CS42L51_ADCA_ATTENUATOR, &attenuator_gain, 0x01);
  BSP_I2C3_WriteReg(AUDIO_I2C_ADDRESS, CS42L51_MIC_CTRL, &mic_control, 0x01);
}

void MX_AudioInit(Audio_Role_t role,
                  Sampling_Freq_t sampling_frequency,
                  Frame_Duration_t frame_duration,
                  uint8_t *pSnkBuff,
                  uint8_t *pSrcBuff,
                  AudioDriverConfig driver_config)
{
  uint32_t sample_per_frame;
  uint32_t audioFrequency;
  uint32_t channel_at_src = 1u;
  BSP_AUDIO_Init_t audio_conf;

  switch (sampling_frequency)
  {
    case SAMPLE_FREQ_8000_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_8K;
      break;

