STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_TMAP_Unicast_Client/Core/Src/app_entry.c
    case SAMPLE_FREQ_16000_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_16K;
      break;

    case SAMPLE_FREQ_22050_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_22K;
      break;

    case SAMPLE_FREQ_24000_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_24K;
      break;

    case SAMPLE_FREQ_32000_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_32K;
      break;

    case SAMPLE_FREQ_44100_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_44K;
      break;

    case SAMPLE_FREQ_48000_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_48K;
      break;

    default:
      Error_Handler();
      return;
  }
  switch(frame_duration)
  {
    case FRAME_DURATION_7_5_MS:
      sample_per_frame = audioFrequency * 75 / 10000;
      break;

    case FRAME_DURATION_10_MS:
      sample_per_frame = audioFrequency * 100 / 10000;
      break;

    default:
      Error_Handler();
      return;
  }

  if (sampling_frequency == SAMPLE_FREQ_44100_HZ)
  {
    /* LC3 need setup like 48Khz for this frequency */
    switch(frame_duration)
    {
      case FRAME_DURATION_7_5_MS:
        sample_per_frame = 360;
        break;

      case FRAME_DURATION_10_MS:
        sample_per_frame = 480;
        break;

      default:
        Error_Handler();
        return;
    }
  }

  __HAL_RCC_I2C3_CLK_ENABLE();

  if (driver_config == AUDIO_DRIVER_CONFIG_HEADSET)
  {
    audio_conf.Device = AUDIO_IN_DEVICE_ANALOG_MIC;
    audio_conf.ChannelsNbr = 1;
    channel_at_src = 1;
  }
  else if (driver_config == AUDIO_DRIVER_CONFIG_LINEIN)
  {
    audio_conf.Device = AUDIO_IN_DEVICE_LINE_IN;
    audio_conf.ChannelsNbr = 2;
    channel_at_src = 2;
  }
  else
  {
    Error_Handler();
  }

  audio_conf.Volume = 50; /* input volume is not used */
  audio_conf.SampleRate = audioFrequency;
  audio_conf.BitsPerSample = AUDIO_RESOLUTION_16B;

  if (BSP_AUDIO_IN_Init(0x00, &audio_conf) != BSP_ERROR_NONE)
  {
    Error_Handler();
  }

  audio_conf.Device = AUDIO_OUT_DEVICE_HEADPHONE;
  audio_conf.ChannelsNbr = 2;
  audio_conf.Volume = Current_Volume;
  if (BSP_AUDIO_OUT_Init(0x00, &audio_conf) != BSP_ERROR_NONE)
  {
    Error_Handler();
  }
  
  if (driver_config == AUDIO_DRIVER_CONFIG_HEADSET)
  {
    BSP_MIC_Gain_Init(MIC_GAIN_CONFIG);
  }

  /* Start SAI clock without DMA interrupt */
  uint8_t channel_at_snk = 2;   /* SAI is in stereo for Headset */
  uint8_t buffer_nb = 2;        /* double buffer strategy for minimum latency*/
  uint8_t bytes_per_sample = 2;

  Sink_frame_size = sample_per_frame * channel_at_snk * buffer_nb;
  Source_frame_size = sample_per_frame * channel_at_src * buffer_nb;
  /* Start SAI clock without DMA interrupt */
  Init_AudioBuffer((uint8_t *)pSnkBuff,
                   Sink_frame_size * bytes_per_sample,
                   (uint8_t *)pSrcBuff,
                   Source_frame_size * bytes_per_sample);

  /* Release Bus for power consumption optimisation */
  __HAL_RCC_I2C3_CLK_DISABLE();
  MxAudioInit_Flag = 1;

}

void MX_AudioDeInit(void)
{
  if (MxAudioInit_Flag == 1)
  {
    MxAudioInit_Flag = 0;

    __HAL_RCC_I2C3_CLK_ENABLE();

    if (BSP_AUDIO_IN_DeInit(0x00) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }

    if (BSP_AUDIO_OUT_DeInit(0x00) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }

    BSP_I2C3_DeInit();
  }

  AudioClock_Deinit();

#if (CFG_LCD_SUPPORTED == 1)
  Menu_SetNoStreamPage();
#endif /* (CFG_LCD_SUPPORTED == 1) */
}

static void Init_AudioBuffer(uint8_t *pSnkBuff, uint16_t SnkBuffLen, uint8_t *pSrcBuff, uint16_t SrcBuffLen)
{
  /* We start the SAI here but will pause the DMA on the first interrupt.
     The DMA will be relauched synchronized to the BLE transport for mastering audio latency */
  if ((SnkBuffLen  > 0) && (pSnkBuff != NULL))
  {
    if (BSP_AUDIO_OUT_Play(0, (uint8_t *)pSnkBuff, SnkBuffLen) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }
    Play_Req_Pause = 1;
  }
  if ((SrcBuffLen  > 0) && (pSrcBuff != NULL))
  {
    if (BSP_AUDIO_IN_Record(0, (uint8_t *)pSrcBuff, SrcBuffLen) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }
    Record_Req_Pause = 1;
  }
}

void Start_TxAudio(void)
{
  /* Initialize Bus which bas been released for Power consumption optimisation */
  __HAL_RCC_I2C3_CLK_ENABLE();

  APP_NotifyTxAudioCplt(Sink_frame_size);
  if (BSP_AUDIO_OUT_Resume(0) != BSP_ERROR_NONE)
  {
    Error_Handler();
  }

  /* Release Bus for power consumption optimisation */
  __HAL_RCC_I2C3_CLK_DISABLE();

  Audio_Role |= AUDIO_ROLE_SINK;

#if (CFG_LCD_SUPPORTED == 1)
  switch (Codec_Frequency)
  {
    case SAMPLE_FREQ_8000_HZ:
    {
      Menu_SetStreamingPage("8KHz", Audio_Role);
      break;
    }
    case SAMPLE_FREQ_16000_HZ:
    {
      Menu_SetStreamingPage("16KHz", Audio_Role);
      break;
    }
    case SAMPLE_FREQ_24000_HZ:
    {
      Menu_SetStreamingPage("24KHz", Audio_Role);
      break;
    }
    case SAMPLE_FREQ_32000_HZ:
    {
      Menu_SetStreamingPage("32KHz", Audio_Role);
      break;
    }
    case SAMPLE_FREQ_44100_HZ:
    {
      Menu_SetStreamingPage("44.1KHz", Audio_Role);
      break;
    }
    case SAMPLE_FREQ_48000_HZ:
    {
      Menu_SetStreamingPage("48KHz", Audio_Role);
      break;
    }
    default:
    {
      Menu_SetStreamingPage("Unknown Frequency", Audio_Role);
      break;
    }
  }
#endif /* (CFG_LCD_SUPPORTED == 1) */
}

void Stop_TxAudio(void)
{
  /* Initialize Bus which bas been released for Power consumption optimisation */
 __HAL_RCC_I2C3_CLK_ENABLE();

  if (BSP_AUDIO_OUT_Stop(0) != BSP_ERROR_NONE)
  {
    Error_Handler();
  }

  /* Release Bus for power consumption optimisation */
  __HAL_RCC_I2C3_CLK_DISABLE();

  Audio_Role = 0;
}

void BSP_AUDIO_OUT_TransferComplete_CallBack(uint32_t instance)
{
  APP_NotifyTxAudioCplt(Sink_frame_size);
}

void BSP_AUDIO_OUT_HalfTransfer_CallBack(uint32_t instance)
{
  if (Play_Req_Pause == 1)
  {
    __HAL_RCC_I2C3_CLK_ENABLE();
    /* Pause the DMA that as run one frame only and wait the codec trigger to re run*/
    if (BSP_AUDIO_OUT_Pause(0) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }
    __HAL_RCC_I2C3_CLK_DISABLE();
    Play_Req_Pause = 0;
  }
  else
  {
    APP_NotifyTxAudioHalfCplt();
  }
}

void Start_RxAudio(void)
{
  /* Initialize Bus which bas been released for Power consumption optimisation */
  __HAL_RCC_I2C3_CLK_ENABLE();

  if (BSP_AUDIO_IN_Resume(0) != BSP_ERROR_NONE)
  {
    Error_Handler();
  }

